-- MySQL dump 10.13  Distrib 8.0.20, for macos10.15 (x86_64)
--
-- Host: localhost    Database: vk
-- ------------------------------------------------------
-- Server version	8.0.22-0ubuntu0.20.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cities`
--

DROP TABLE IF EXISTS `cities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cities` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор строки',
  `country_id` int unsigned NOT NULL,
  `name` varchar(50) NOT NULL COMMENT 'Название города',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Время создания строки',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Время обновления строки',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=129 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Список стран';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cities`
--

LOCK TABLES `cities` WRITE;
/*!40000 ALTER TABLE `cities` DISABLE KEYS */;
INSERT INTO `cities` VALUES (1,71,'South Isadorechester','2020-10-22 18:16:40','2020-10-22 18:29:00'),(2,22,'North Kale','2020-10-22 18:16:40','2020-10-22 18:29:00'),(3,58,'East Jasonshire','2020-10-22 18:16:40','2020-10-22 18:29:00'),(4,62,'Lake Verda','2020-10-22 18:16:40','2020-10-22 18:29:00'),(5,54,'Walterstad','2020-10-22 18:16:40','2020-10-22 18:29:00'),(6,1,'Tonimouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(7,8,'Oberbrunnerstad','2020-10-22 18:16:40','2020-10-22 18:29:00'),(8,34,'Louisaside','2020-10-22 18:16:40','2020-10-22 18:29:00'),(9,66,'Priscillaland','2020-10-22 18:16:40','2020-10-22 18:29:00'),(10,63,'East Felicity','2020-10-22 18:16:40','2020-10-22 18:29:00'),(11,34,'Huldamouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(12,62,'Port Bethel','2020-10-22 18:16:40','2020-10-22 18:29:00'),(13,44,'Port Hesterview','2020-10-22 18:16:40','2020-10-22 18:29:00'),(14,33,'Hansstad','2020-10-22 18:16:40','2020-10-22 18:29:00'),(15,33,'North Khalidhaven','2020-10-22 18:16:40','2020-10-22 18:29:00'),(16,66,'South Jennifertown','2020-10-22 18:16:40','2020-10-22 18:29:00'),(17,64,'Tremblaybury','2020-10-22 18:16:40','2020-10-22 18:29:00'),(18,42,'South Nicoleborough','2020-10-22 18:16:40','2020-10-22 18:29:00'),(19,18,'South Maryamstad','2020-10-22 18:16:40','2020-10-22 18:29:00'),(20,45,'Hoegerchester','2020-10-22 18:16:40','2020-10-22 18:29:00'),(21,7,'New Destinimouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(22,62,'North Fatimaport','2020-10-22 18:16:40','2020-10-22 18:29:00'),(23,43,'West Clay','2020-10-22 18:16:40','2020-10-22 18:29:00'),(24,29,'North Kaileyhaven','2020-10-22 18:16:40','2020-10-22 18:29:00'),(25,15,'Port Timmy','2020-10-22 18:16:40','2020-10-22 18:29:00'),(26,70,'East Gaylord','2020-10-22 18:16:40','2020-10-22 18:29:00'),(27,58,'Christophermouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(28,78,'Kubton','2020-10-22 18:16:40','2020-10-22 18:29:00'),(29,52,'Meggieberg','2020-10-22 18:16:40','2020-10-22 18:29:00'),(30,26,'Port Dillanfort','2020-10-22 18:16:40','2020-10-22 18:29:00'),(31,54,'Doylefort','2020-10-22 18:16:40','2020-10-22 18:29:00'),(32,28,'West Sophiebury','2020-10-22 18:16:40','2020-10-22 18:29:00'),(33,59,'Port Rosamond','2020-10-22 18:16:40','2020-10-22 18:29:00'),(34,49,'Lake Araville','2020-10-22 18:16:40','2020-10-22 18:29:00'),(35,66,'Wintheisertown','2020-10-22 18:16:40','2020-10-22 18:29:00'),(36,21,'Port Luz','2020-10-22 18:16:40','2020-10-22 18:29:00'),(37,67,'New Beau','2020-10-22 18:16:40','2020-10-22 18:29:00'),(38,27,'Lake Kayceeland','2020-10-22 18:16:40','2020-10-22 18:29:00'),(39,16,'North Theochester','2020-10-22 18:16:40','2020-10-22 18:29:00'),(40,81,'Micahport','2020-10-22 18:16:40','2020-10-22 18:29:00'),(41,26,'North Herminiaville','2020-10-22 18:16:40','2020-10-22 18:29:00'),(42,51,'Port Fidel','2020-10-22 18:16:40','2020-10-22 18:29:00'),(43,12,'West Jarred','2020-10-22 18:16:40','2020-10-22 18:29:00'),(44,73,'Adammouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(45,81,'Lake Jairo','2020-10-22 18:16:40','2020-10-22 18:29:00'),(46,21,'East Carterside','2020-10-22 18:16:40','2020-10-22 18:29:00'),(47,26,'New Sherwood','2020-10-22 18:16:40','2020-10-22 18:29:00'),(48,65,'East Marlon','2020-10-22 18:16:40','2020-10-22 18:29:00'),(49,1,'Ottisland','2020-10-22 18:16:40','2020-10-22 18:29:00'),(50,56,'Bahringerland','2020-10-22 18:16:40','2020-10-22 18:29:00'),(51,30,'Heleneville','2020-10-22 18:16:40','2020-10-22 18:29:00'),(52,66,'South Magdalenachester','2020-10-22 18:16:40','2020-10-22 18:29:00'),(53,73,'Port Estefaniamouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(54,4,'Scotstad','2020-10-22 18:16:40','2020-10-22 18:29:00'),(55,48,'Reichertfurt','2020-10-22 18:16:40','2020-10-22 18:29:00'),(56,62,'Isobelstad','2020-10-22 18:16:40','2020-10-22 18:29:00'),(57,2,'West Kaleb','2020-10-22 18:16:40','2020-10-22 18:29:00'),(58,68,'Krystelmouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(59,6,'West Richardville','2020-10-22 18:16:40','2020-10-22 18:29:00'),(60,73,'Watsicafurt','2020-10-22 18:16:40','2020-10-22 18:29:00'),(61,17,'East Hermannchester','2020-10-22 18:16:40','2020-10-22 18:29:00'),(62,29,'Port Casimir','2020-10-22 18:16:40','2020-10-22 18:29:00'),(63,11,'Greenfeldershire','2020-10-22 18:16:40','2020-10-22 18:29:00'),(64,48,'New Joseside','2020-10-22 18:16:40','2020-10-22 18:29:00'),(65,45,'Port Candelario','2020-10-22 18:16:40','2020-10-22 18:29:00'),(66,80,'Larkintown','2020-10-22 18:16:40','2020-10-22 18:29:00'),(67,19,'East King','2020-10-22 18:16:40','2020-10-22 18:29:00'),(68,17,'Skilesside','2020-10-22 18:16:40','2020-10-22 18:29:00'),(69,28,'North Oletamouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(70,6,'Botsfordside','2020-10-22 18:16:40','2020-10-22 18:29:00'),(71,30,'Port Eulalia','2020-10-22 18:16:40','2020-10-22 18:29:00'),(72,48,'Lake Dorisshire','2020-10-22 18:16:40','2020-10-22 18:29:00'),(73,67,'East Nola','2020-10-22 18:16:40','2020-10-22 18:29:00'),(74,25,'Georgiannaton','2020-10-22 18:16:40','2020-10-22 18:29:00'),(75,9,'East Lisaborough','2020-10-22 18:16:40','2020-10-22 18:29:00'),(76,48,'Hudsonmouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(77,50,'Lake Santaberg','2020-10-22 18:16:40','2020-10-22 18:29:00'),(78,25,'Christyville','2020-10-22 18:16:40','2020-10-22 18:29:00'),(79,53,'Lake Jettieside','2020-10-22 18:16:40','2020-10-22 18:29:00'),(80,29,'West Carolanneport','2020-10-22 18:16:40','2020-10-22 18:29:00'),(81,66,'Nelschester','2020-10-22 18:16:40','2020-10-22 18:29:00'),(82,77,'South Daphnee','2020-10-22 18:16:40','2020-10-22 18:29:00'),(83,22,'Starkshire','2020-10-22 18:16:40','2020-10-22 18:29:00'),(84,44,'Sidneymouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(85,72,'Catalinashire','2020-10-22 18:16:40','2020-10-22 18:29:00'),(86,64,'Hoppeton','2020-10-22 18:16:40','2020-10-22 18:29:00'),(87,20,'Port Albaside','2020-10-22 18:16:40','2020-10-22 18:29:00'),(88,73,'Shanonfurt','2020-10-22 18:16:40','2020-10-22 18:29:00'),(89,59,'Mustafaberg','2020-10-22 18:16:40','2020-10-22 18:29:00'),(90,73,'New Nathanael','2020-10-22 18:16:40','2020-10-22 18:29:00'),(91,23,'Dietrichmouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(92,63,'East Sebastian','2020-10-22 18:16:40','2020-10-22 18:29:00'),(93,79,'New Cesar','2020-10-22 18:16:40','2020-10-22 18:29:00'),(94,42,'South Bernhardfort','2020-10-22 18:16:40','2020-10-22 18:29:00'),(95,53,'Weldonstad','2020-10-22 18:16:40','2020-10-22 18:29:00'),(96,58,'North Genevievemouth','2020-10-22 18:16:40','2020-10-22 18:29:00'),(97,49,'Josuebury','2020-10-22 18:16:40','2020-10-22 18:29:00'),(98,71,'Franeckistad','2020-10-22 18:16:40','2020-10-22 18:29:00'),(99,44,'West Emilside','2020-10-22 18:16:40','2020-10-22 18:29:00'),(100,5,'East Bennett','2020-10-22 18:16:40','2020-10-22 18:29:00');
/*!40000 ALTER TABLE `cities` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-10-29 20:21:49
